app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Maths"], ["room_number", 3002], ["created_at", "2018-07-02 08:26:42.912277"], ["updated_at", "2018-07-02 08:26:42.912277"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class))
    @school_class.save